---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Standard
enum: Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation
source: html/bb27708f-110c-f59b-3056-b8c45eabe5f6.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Standard

The Bending Detail will represent the bar segments as they are.